docs/deployment-kubernetes.org
#+TITLE: Deployment with Kubernetes
#+AUTHOR: Caleb Woodbine <calebwoodbine.public@gmail.com>
#+FIRN_UNDER: Deployment
#+FIRN_ORDER: 0

* Deployment with Kubernetes

** Configuration
Chart values are located in [[https://gitlab.com/flattrack/flattrack/-/blob/master/deployments/flattrack/values.yaml][../deployments/flattrack/values.yaml]].

| Parameter                                             | Description                                                  | Default                                 |
|-------------------------------------------------------+--------------------------------------------------------------+-----------------------------------------|
| replicaCount                                          | FlatTrack replica Pods                                       | 1                                       |
| image.repository                                      | The repo where the image lives                               | registry.gitlab.com/flattrack/flattrack |
| image.tag                                             | Specifies a tag of from the image to use                     | ~nil~                                   |
| image.pullPolicy                                      | FlatTrack container pull policy                              | IfNotPresent                            |
| imagePullSecrets                                      | References for the registry secrets to pull FlatTrack from   | ~[]~                                    |
| nameOverride                                          | Expand the name of the chart                                 | ~""~                                    |
| fullNameOverride                                      | Create a FQDN for the app name                               | ~""~                                    |
| podSecurityContext.readOnlyRootFilesystem             | Set the rootfs as read-only                                  | true                                    |
| podSecurityContext.runAsUser                          | The user to run as                                           | 1000                                    |
| podSecurityContext.runAsGroup                         | The group to run as                                          | 1000                                    |
| podSecurityContext.allowPrivilegeEscalation           | If the process in the container can become root              | true                                    |
| service.type                                          | In way which the app is exposed                              | ClusterIP                               |
| service.port                                          | The port to run the app on                                   | 8080                                    |
| horizonalPodAutoscaler.enabled                        | If the Pods should autoscale                                 | true                                    |
| horizonalPodAutoscaler.minReplicas                    | Minimum amount of Pods                                       | 2                                       |
| horizonalPodAutoscaler.maxReplicas                    | Maximum amount of Pods                                       | 5                                       |
| horizonalPodAutoscaler.targetCPUUtilizationPercentage | How much resource should be utilized before scaling          | 5                                       |
| podDisruptionBudget.enabled                           | define the max number of disruptions allowed                 | enable                                  |
| podDisruptionBudget.minAvailable                      | minimum number of Pods that should always be available       | 2                                       |
| podDisruptionBudget.maxUnavailable                    | max amount of Pods that are allowed to be unavailable        |                                         |
| prometheus.enabled                                    | enable Prometheus annotations                                | true                                    |
| networkPolicy.enabled                                 | enable networkPolicy rules                                   | false                                   |
| networkPolicy.ingress                                 | configure Ingress policy rules                               | {}                                      |
| networkPolicy.egress                                  | configure Egress policy rules                                | {}                                      |
| extraEnvVars                                          | declare extra environment variables                          |                                         |
| postgres.enabled                                      | use the helm chart to set the database credentials           | true                                    |
| postgres.username                                     | the username for an existing Postgres databse                | flattrack                               |
| postgres.password                                     | the password for an existing Postgres databse                | flattrack                               |
| postgres.host                                         | the host for an existing Postgres databse                    | flattrack                               |
| postgres.database                                     | the database for an existing Postgres databse                | flattrack                               |
| postgres.sslmode                                      | the sslmode for an existing Postgres databse                 | disable                                 |
| smtp.enabled                                          | enable SMTP for messages and notifications                   | false                                   |
| smtp.username                                         | SMTP username                                                | ~""~                                    |
| smtp.password                                         | SMTP password                                                | ~""~                                    |
| smtp.host                                             | SMTP host                                                    | ~""~                                    |
| smtp.port                                             | SMTP port                                                    | ~""~                                    |
| siteURL                                               | the URL of the site                                          | ~""~                                    |
| realIPHeader                                          | a HTTP header to use for forwarding the real IP address      | ~""~                                    |
| labels                                                | declare labels for all resources                             | ~{}~                                    |
| annotations                                           | declare annotations for all resources                        | ~{}~                                    |
| ingress.enabled                                       | create an ingress manifests                                  | false                                   |
| ingress.annotations                                   | set annotations for the ingress manifest                     | ~{}~                                    |
| ingress.hosts                                         | the hosts which the ingress endpoint should be accessed from |                                         |
| ingress.tls                                           | references to TLS secrets                                    | ~[]~                                    |
| resources.limits.cpu                                  | max amount of CPU                                            | 250m                                    |
| resources.limits.memory                               | max amount of memory                                         | 40Mi                                    |
| resources.resources.cpu                               | requested amount of CPU                                      | 250m                                    |
| resources.limits.memory                               | max amount of memory                                         | 40Mi                                    |
| nodeSelector                                          | declare the node labels for Pod scheduling                   | ~{}~                                    |
| tolerations                                           | declare the toleration labels for Pod scheduling             | ~[]~                                    |
| affinity                                              | declare the affinity settings for the Pod scheduling         | ~{}~                                    |

** Installation
Create the namespace:
#+begin_src sh :src ../
  kubectl create namespace flattrack-myflat
#+end_src

Install the release with Helm:
#+begin_src sh :src ../
  helm install flattrack-myflat --namespace flattrack-myflat deployments/flattrack
#+end_src

* Extra notes

To configure FlatTrack, please refer to the [[./configuration.org][configuration guide]].
